---
kind: type
id: T:Autodesk.Revit.UI.RevitCommandId
source: html/0fb2f851-f469-f739-d6ee-89b40b25c4a2.htm
---
# Autodesk.Revit.UI.RevitCommandId

Represents a command id in Autodesk Revit.

## Syntax (C#)
```csharp
public class RevitCommandId : IDisposable
```

## Remarks
Each Revit command is assigned a command id and non-localized name.
 This class allows you to look up a command by its name, and represents any Revit command in the use of an AddInCommandBinding.